request_ags_1.xml

<?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://facturacion.finkok.com/cancel" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="http://facturacion.finkok.com/cancellation" xmlns:ins1="apps.services.soap.core.views"><env:Body><tns:cancel>  <tns:UUIDS>
    <tns:uuids>
      <tns:string>A4DE6395-1C64-490E-94F2-5A5E712504D9</tns:string>
    </tns:uuids>
  </tns:UUIDS>
  <tns:username>plataforma-dc@outlook.com</tns:username>
  <tns:password>Disen0s22_</tns:password>
  <tns:taxpayer_id>VEMF8310119M7</tns:taxpayer_id>
  <tns:cer>LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUdDRENDQS9DZ0F3SUJB
Z0lVTURBd01ERXdNREF3TURBME1EUXpPVEF5T1RBd0RRWUpLb1pJaHZjTkFR
RUwKQlFBd2dnR3lNVGd3TmdZRFZRUUREQzlCTGtNdUlHUmxiQ0JUWlhKMmFX
TnBieUJrWlNCQlpHMXBibWx6ZEhKaApZMm5EczI0Z1ZISnBZblYwWVhKcFlU
RXZNQzBHQTFVRUNnd21VMlZ5ZG1samFXOGdaR1VnUVdSdGFXNXBjM1J5CllX
TnB3N051SUZSeWFXSjFkR0Z5YVdFeE9EQTJCZ05WQkFzTUwwRmtiV2x1YVhO
MGNtRmphY096YmlCa1pTQlQKWldkMWNtbGtZV1FnWkdVZ2JHRWdTVzVtYjNK
dFlXTnB3N051TVI4d0hRWUpLb1pJaHZjTkFRa0JGaEJoWTI5awpjMEJ6WVhR
dVoyOWlMbTE0TVNZd0pBWURWUVFKREIxQmRpNGdTR2xrWVd4bmJ5QTNOeXdn
UTI5c0xpQkhkV1Z5CmNtVnliekVPTUF3R0ExVUVFUXdGTURZek1EQXhDekFK
QmdOVkJBWVRBazFZTVJrd0Z3WURWUVFJREJCRWFYTjAKY21sMGJ5QkdaV1Js
Y21Gc01SUXdFZ1lEVlFRSERBdERkV0YxYUhURHFXMXZZekVWTUJNR0ExVUVM
Uk1NVTBGVQpPVGN3TnpBeFRrNHpNVjB3V3dZSktvWklodmNOQVFrQ0RFNVNa
WE53YjI1ellXSnNaVG9nUVdSdGFXNXBjM1J5CllXTnB3N051SUVObGJuUnlZ
V3dnWkdVZ1UyVnlkbWxqYVc5eklGUnlhV0oxZEdGeWFXOXpJR0ZzSUVOdmJu
UnkKYVdKMWVXVnVkR1V3SGhjTk1UWXhNVEk1TVRjME9EUTFXaGNOTWpBeE1U
STVNVGMwT0RRMVdqQ0JxREVjTUJvRwpBMVVFQXhNVFJrRldTVThnVmtWTVJW
b2dUVTlTUVV4RlV6RWNNQm9HQTFVRUtSTVRSa0ZXU1U4Z1ZrVk1SVm9nClRV
OVNRVXhGVXpFY01Cb0dBMVVFQ2hNVFJrRldTVThnVmtWTVJWb2dUVTlTUVV4
RlV6RVdNQlFHQTFVRUxSTU4KVmtWTlJqZ3pNVEF4TVRsTk56RWJNQmtHQTFV
RUJSTVNWa1ZOUmpnek1UQXhNVWhPUlV4U1ZqQXpNUmN3RlFZRApWUVFMRXc1
QlozVmhjMk5oYkdsbGJuUmxjekNDQVNJd0RRWUpLb1pJaHZjTkFRRUJCUUFE
Z2dFUEFEQ0NBUW9DCmdnRUJBSmEzaVlsTEYzSXNYNHg3aXBnYlFVTUlrQlZy
WWcwb1pXZC9nRVdoZ0picmh6eUNZdmpJZ3IxYkQyZVIKM1k5b1hSVzNiUk9R
YThoTnE1OHc2VVB5WnRJbGxXNytZZmpyUlF4alJub0pML3VnOGZrc0NpSEwv
WVhsaFdqRwp4emM1alR0KzZ5UVFsQVhCQTB1WUFQdlZKazd0cGZUYlFQRXls
aTFUZXFpcEQ1QVFxRExTQ29UenIvTHZpVmI3ClBrdlBFOG1GbW9vN1JUVVZq
MVgybndxSGxpeXkzNlEvYVNkeUxkUDJSd1MydXZtZTBTMWd4VjdkYnQ1dktq
c1cKOUFTSTA4ZVgxbXczbHdWM2ZUT0RsbWRHSVAyRUtucUJKMUExLzRMbjJF
N3hxaU1FUFRRbit2aEg0eEdqYzQ5RQpnNVUwSWNhbDEvOGthY0NIbWdGczBU
VDdBa1VDQXdFQUFhTWRNQnN3REFZRFZSMFRBUUgvQkFJd0FEQUxCZ05WCkhR
OEVCQU1DQnNBd0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dJQkFDTGV6SGg0Y3U2
ZVg4aWRXV1hqbnhCTmZDMkoKN1QzSnp2RXpFM1NZOWluYnViQWhjM0Y2VWJK
eEhvaURFa1JCd1hlYllzVEV0ai9SUmZWL2hqa25rTVJsVTRaZgpzTmxVRWJY
L0VkM21pNkVjS1U5b3B3U0hpU2pwd09Wd1ZTM1lVVWhqejRkUTZyN1NJU2tz
enBDUmJuNExlQUNVCitmaFI0WGF2MXUyeUsxL1Nab1lNYllMcExUU29ZeGt5
OEJWY3lQbDlNaWZnK012ako3NThmN0hBVkd3OE1pelYKN0liZVlZWWc0TFV1
RThCa3k0K1Z3bTNDWGIvTGRpekZZcUl4bHk2NnhHeklBRVFaSzJoRksyeVpn
SldCdjBRUApBMktLZFVsVFBSVUVDN2ZzRmZKbHVKTjZMUGZvT2tHRUtyejMz
OUJoR0tjRlJhQmgyS05LVmhZR2ZNYWkvZjE5CmR6ZjBtODQxWllEb3U0RHlW
Y1V0QWJXNEZkSU83S3l0NEJ4ZW00RkwzZW1zZ01xaWVtamxhZkVkZWQ3WGEz
cG8KNzh2VUtpRUEzSnpxNzlnNXdTdERKWVpRSTkzRjlWTDZ4QS9OSE1PQjIz
dncwb1ZwN29TL25NZzMyT1FpcStRSApiSXo4WUE1NDMyUTVjUkFTbFBRTWZO
WkY0UmRnK0hTYnY3UTJaTnlDTDRSM2FNZXlnU3pIZ0kzVVR1Tms3YXBPCkdX
NUtTRE5ZRStiQWVGSHU4NW55eXpZRC91aHg0am5LRW9FTllhR0xUQmdlTU42
WlN2S3BQbEx6azFhZmJzYkwKdEJZVmlHYnR1MlYxd2w3VzFxR2xpcGNrZUw5
YUdaK3dHakdOcVZlWTF5NWVGY21mOGUyeFV4Y3ZicjVNSktBTAp2ZmpOdE9E
RWt6TWxGOFFoCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
</tns:cer>
  <tns:key>LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQpQcm9jLVR5cGU6IDQs
RU5DUllQVEVECkRFSy1JbmZvOiBERVMtRURFMy1DQkMsRjIwRTIzQzhBNjNB
MkYxOAoKSkFJS3h4Q2daWHVEOTBqYk00YUViTHZYV25vaTk0ei8vYkRVOXZs
OHI4eDJVclZYZWtHMHZ2NDNNcWJkcWFQVQpvVVI1T21QRDZlNlhaeXBCdi9X
L3Q4Qk82T0k3NGRSNWs4VXZGMm5pcGZZNGJZaUhWMFJwMlBIeGFXaTFRTVFL
CmYzMWhuRTV6Y1RJY0xtdnR4MjEvZEFKcmExeVlqUXZqTkp4bUwxSWhRREp6
aWpWK3ZHT2JpREZiOEoxUUxyWlUKNWdKNlJGeWI1RDlTb3p3NlVoRGJVdkEv
Rkk4UUVIM2RUTnpNUXFmL2d0VDJ6aC8vakkxWWdmSm5kQnhxTHllaApOT2hq
czBKdXlNR3F3YjNoTGZLeGRqWWNhaUZXQ0dYNlZ5dFNacnJvMlFTYnYrYXd0
TGVyOTFGSXJEQm5tb1U2ClVramdFYXE1d1Jod0puSm9vK0xCc0Nsa25yMnlW
djFsS3NYUU1rNGVoY1ZzcFoycEdIZUtvWlNBQm0zUEhNZDQKdUM4dW1ITS93
RUxSZlNsSXMyMFRmSkpwSkpGNGhOZ2FsL0ZEOUtENTRzVVF5TkVJb3V6cVFz
YnVKNjVBUmJJbQp6YjdiQWk3TjVSZkllcVk2RzVSLzRrdkpUVlFJUWlmNG1D
V043dUx3MERkMXJWNWNacVRmL3hHMDk3Ly9WdVFBCk9RZnplTklpb0R3Nzc5
bEpZWmhJVGNtVWo2ZXJaVnZBQjFGRVdUMVlkaDBwQzlkQitKeXF3SkhSeGZT
a2l0NDUKTVZqL1VPbE55a0h5dHJWVTJzcEJiNlRNTkVYSTMra3Vjd0h1UVg3
cGUvV3hOSk5qdlpPSlBCMlBFMFBBU1lsSQpTWE9HQ3NTOFlqMVNMenJGSlh5
ZVkwMkZXN2RhaGF1cmF6ZGw0Q1c0RTNLcmFTZ3ArekJRRFNTd2lGU2g0V1hN
ClBGOVk3cm8wYmlVSmFrblhCdmQrMmxVL0JQbFdmdVZ1NFBDSXFBbU5RU1di
dnU4VHN5OFkyUjliOC9vUmdGOTcKckc2MVFRRHVDTlhXQUZsbkpuQTZ0SVRX
eHoxejJCV2EwMXZwMy9JSzhjRkY4UmxPbUwvY0puK09aOS82VG9VdApiQlJt
aExhaHFOK2x0anpXSHoxaFVTbllicWwyQ3RFUkhLR3BPZGhoL1VlMVI3SVY1
c21JZTdyK2lza1JtS1YyCjdHMWVPaGt4T1dJK1R6a1E5UUtva21aM2g0VE0x
VTlkemtMcUwrS0JIc0l2KzkzUG5sLzhkdmZRTTcwSXBLUlkKVjRrWEFnRjRl
VklNVnNid0R0V0RMMXpiZWNiQTlQc3ExZHFuOW9uTzFCeUxPSnNrK0Rlc3V2
RDVLcEtSTHRzWApsb3EyMUN5K0FXYTVzM1lndkJmWEtReVg1Ulg1aU5JUC9k
aThlUW8yRElBOEVVZDBTaDVRMldQSWl4YTRZeGorCko4bVdzMUl2REpTa2Fo
UkFhUjdGVy9BSmM3djJTRWQ0SVc5UDFScE9URUtIUWhrZWNjY1M1U0Z5cklv
Vmg4UUkKMzdybzRHdG0rdHBCTEQwRDRTcVowL3V5U1kvWExVQlZUOVVHYm4x
MCtUOGdyTDU3YVhFbWRRRlZ2SnBOdHFCOApIcFVvRjVJaE80KytOVHg4ZHJs
TjlWRkRVMHlmYVNwSTM5NTJjSXZrSHdja1J6T3d4ZURsS2NKN2R2OGZTUXlt
CnJHYXRScWlxUGsvNTRsY2V3U0cwQ2pmK0NmSSszT3BCck1QS1NTRjJDZ0Rw
TVZ5ODgrNXlKWkhaTXh5TURUN28KMTFLWnhHcUVDVkR6ZkFBMDZLaGJwcXFH
T28wVkJ2am1UbzlaanFLQittY3htbU81Uk5lUDVremF5a25PQXpkYgpFd2xp
M2F4bVdKZ1VJOXd1TzBHc0NRRGpPR1V3NGw3WXpQR05lWCt2SjU1MjZsT09r
Z2p1MXl5RnprU2gzWDU3CkFEQ0RmUGJVcFN5bGErOFZTbVVJaWdoTy9CSXg2
eTVJekZaMlh6N2plV2lwbUJ1dERYaDNLUVZqVHh2R0JJWUcKRFU5YnVoTDJP
Rk1qb3h1SUx3YS9CTENvUDFOaUZSSnl5L2J6eTBQUUJlUGlNRGdsaUpscU92
TXJKUGsvY09TQwotLS0tLUVORCBSU0EgUFJJVkFURSBLRVktLS0tLQo=
</tns:key>
</tns:cancel></env:Body></env:Envelope>