factupid/app/templates/soap_request/cancel.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
	<Body>
		<cancel xmlns="http://facturacion.finkok.com/cancel">
			<!-- Optional -->
			<UUIDS>
				<!-- Optional -->
				<!-- <UUID xmlns="apps.services.soap.core.views"/> -->
				{% for uuid in uuids %}
					<UUID UUID="{{ uuid.UUID }}"  FolioSustitucion="{{ uuid.FolioSustitucion }}" Motivo="{{ uuid.Motivo }}"/>
				{% endfor %}
			</UUIDS>
			<username>{{ username }}</username>
			<password>{{ password }}</password>
			<taxpayer_id>{{ taxpayer_id }}</taxpayer_id>
			<cer>{{ cer }}</cer>
			<key>{{ key }}</key>
			<store_pending>{{ store_pending }}</store_pending>
		</cancel>
	</Body>
</Envelope>